app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY eventDate DESC
---
  def index
    @events = Event.all

INSERT INTO "events" ("eventDate", "eventName", "eventOwner", "eventLocation", "eventDescription", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.create!(event_params)